Tekla Open API Reference for Tekla Structures 2025
IEvents.SelectionChange Event
 The SelectionChange event is raised when the user changes the current selection inside Tekla Structures.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.SelectionChangeDelegate SelectionChange
Event SelectionChange As Events.SelectionChangeDelegate
Value
Type: Tekla.Structures.Model.Events.SelectionChangeDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace